# SetDormerThick

## Description
Procedure SetDormerThick sets dormer roof and wall thicknesses for the referenced roof.

```pascal
PROCEDURE SetDormerThick(
				roofObject        : HANDLE;
				wallThickDistance : REAL;
				roofThickDistance : REAL);
```

```python
def vs.SetDormerThick(roofObject, wallThickDistance, roofThickDistance):
    return None
```

## Parameters
|Name|Type|Description|
|---|---|---|
|roofObject|HANDLE|Handle to roof.|
|wallThickDistance|REAL|Wall thickness of dormer.|
|roofThickDistance|REAL|Roof thickness of dormer.|

## Examples
eateRoofOb}}

## Version
Availability: from VectorWorks8.0

## Category
* Objects - Roofs